app/Controllers/BlogApp.php

INSERT INTO `blog_with_image` (`title`, `content`, `imageName`, `created_at`, `updated_at`) VALUES ('adsfs', 'sdfsd', '[]', '2024-02-01 12:14:54', '2024-02-01 12:14:54')
---
    public function create(){
        $title = $this->request->getPost('title');
        $content = $this->request->getPost('content');

        $image = $this->request->getFile('image');

        $uniqueName = $this->saveImage($image);

        if($this->request->getMethod() == 'post'){
            $blogWithImage = new BlogWithImage();
            $blogWithImage->save([
                'title' => $title,
                'content' => $content,
                'imageName' => $uniqueName
            ]);