app/Models/BlogWithImage.php

SELECT *
FROM `blog_with_image`
---
    public function getBlogData(){
        return $this->findAll(); // Retrieve all records from the 'blog' table